Repository: yamato/perl6doc-jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: If followed by a block it does not parse as a list operator or even as a prefix unary; it will never look for any additional expression following the block.
ja: もしブロックが続くリスト演算子か単項の接頭辞としてパースしないなら；ブロックに続く追加のどんな式も探さないだろう。

source: If instead of the above you say:
ja: 上述の代わりに次のように書くなら：

source: If instead the users of this object should be able to reset a task's completion state (perhaps to perform it again), you can change the attribute declaration:
ja: その代わりにこのオブジェクトのユーザーが仕事の完成状態（おそらく再びそれを実行するために）をリセットすることができるべきであるならば、あなたは属性宣言を変えることができます：

source: If more than one on-message multi candidate matches, Perl will call all of them, whether found by multiple dispatch, searching the inheritance hierarchy, or both.
ja: 1つ以上のon-messageマルチ候補がマッチするならば、マルチディスパッチによって、継承階層を捜して、または両方で、見つかるかどうかにかかわらず、Perlはそれらのすべてを呼び出すでしょう。

source: If multiple parameters have type constraints, each argument must fulfill the type constraint of the parameter to which it binds.
ja: 複数のパラメータが型制約を持っているなら、それぞれの引数はパラメータがバインドする型制約を満たさなければなりません。

source: If no on-message multi candidates match, the call will not produce an error.
ja: on-messageマルチ候補にマッチがない場合、呼び出しはエラーを出さないでしょう。

source: If no argument is passed, an undefined value will be bound to the parameter.
ja: 引数が渡されなかったら、未定義値がパラメータにバインドされます。

source: If no explicit handler handles it, the implicit outermost exception handler will eventually decide to abort and print all unhandled exceptions passed in as its current @! list.
ja: もし明示的なハンドラがそれをハンドルしないなら、暗黙の最も外側の例外ハンドラは結局無視して現在の@!リストとして渡される全てのハンドルされない例外をプリントすると決定する。

source: If no such method exists, the grammar engine continues parsing the rest of the grammar.
ja: そのようなメソッドが存在しないなら、グラマーエンジンは残りを解析し続けます。

source: If none of the cases in the CATCH handles the exception, the exception will be rethrown.
ja: CATCHの例外を扱うケースがないなら、例外は再スローされるだろう。

source: If one of the objects is not numeric, Perl will do its best to make it numeric before doing the comparison.
ja: オブジェクトの1つが数でないなら、Perlは比較する前にそれを数にするために全力を尽くすでしょう。

source: If read-only binding is too limiting, you can relax this restriction by applying the is rw ("rw" being short for read/write) trait to a parameter.
ja: 読み取り専用のバインディングが制限的すぎるなら、is rwトレイトをパラメータに適用することで制限を緩めることができます。（“rw”はread/writeの略）

source: If so, there's nothing to do.
ja: もしそうなら、することはありません。

source: If some of your users are British and others are Americans, you might write:
ja: もし何人かのユーザーがイギリス人で、他がアメリカ人なら、あなたは次のように書くかもしれません：

source: If somebody forgets to add that whitespace, a regex can clean up after the lazy writer:
ja: 誰かがその空白文字を加えるのを忘れたならば、正規表現は怠惰な作家の後片付けをすることができます：

source: If such use can't be detected because it is hidden in an eval, then it is erroneous, since the eval() compiler might bind to either $OUTER::x or the subsequently declared "my $x".
ja: もしevalに隠されてそのような使用が発見できないならそれは誤りだ。だからeval()コンパイラは$OUTER::xかその後に宣言された「my $x」にバインドするかもしれない。

source: If that check succeeds, it calls the code block.
ja: そのチェックが成功するならば、それはコードブロックを呼びます。

source: If the (::T, T) candidate matches, the type capture in the first parameter does not contribute any narrowness--it is not a constraint, after all.
ja: もし(::T, T)候補がマッチするなら、最初のパラメータの型キャプチャは狭さに貢献しません ― 結局、それは制約ではありません。

source: If the (Scissors, Paper) candidate matches the supplied argument list, it is two steps narrower than the (Any, Any) fallback, because both Scissors and Paper are direct subtypes of Any, so both contribute one step.
ja: (Scissors, Paper)候補が供給された引数リストにマッチするならば、ScissorsとPaperがAnyの直接のサブタイプであるので、それは(Any, Any)の代替より2歩制限されているので、双方とも1歩に寄与します。

source: If the gather contains no take lexically, it by definition cannot be the lexotic target of any take, so it can only harvest dynamic take calls.
ja: gatherがtakeをレキシカルに含んでいないなら、定義によってどんなtakeのレギゾチックターゲットにもなれない。なので動的なtake呼び出しだけ収納できる。

source: If the class provides a method of the same name that is also multi, then all methods defined in the role and the class will combine into a set of multi candidates.
ja: クラスがマルチでもある同じ名前のメソッドを提供するならば、ロールとクラスで定義したすべてのメソッドは一組のマルチ候補に統合するでしょう。

source: If the conditional does not execute any branch, the return value is ().
ja: もし条件がいずれの分岐も実行しないなら、返り値は()になる。

source: If the failure throws its exception and the exception resumes, the thrower by default returns the null string ('') to whatever caused the failure to throw its exception.
ja: もし失敗が例外をスローして例外が再開するなら、スロー元はデフォルトで例外をスローするための失敗を引き起こすならなんでもnull文字列（''）を返す。

source: If the object is of that class, or of an inheriting class, it returns true.
ja: オブジェクトがそのクラスの、または継承しているクラスであれば、それは真を返します。

source: If the role composer detects a method with the same name in the class body, it will then disregard all of the (possibly conflicting) ones from the roles.
ja: ロールコンポーザーがクラス本体に同じ名前のメソッドを見つけたら、それはロールからのもの（おそらく競合する）すべてを無視するでしょう。

source: If the smart match fails, control proceeds the next statement normally, which may or may not be a when statement.
ja: もしスマートマッチが失敗したら、制御は通常通り次の文へ進み、そしてそれはwhen文になるかどうかわからない。

source: If the smart match succeeds, when's associated block is executed, and the innermost surrounding block that has $_ as one of its formal parameters (either explicit or implicit) is automatically broken out of.
ja: もしスマートマッチが成功したら、whenに関連付けられたブロックは実行され、$_を仮パラメータ（明示的か暗黙的）の一つとして持つ最も深い部分を囲うブロックは自動的に切り離される。

source: If the type of the operands differs from the type of the operand, Perl will make copies of the operands and convert them to the needed types.
ja: オペランドの型と型が異なるならば、Perlはオペランドのコピーを作成して、それらを必要とされる型に変換します。

source: If the warning exception supports the .resume_value method, that will be the value of the failure after it has resumed.
ja: もし警告例外が.resume_valueメソッドをサポートするなら、それが再開された後に失敗の値になるだろう。

source: If the wide type is omitted, Any is assumed.
ja: 広い型が省略されるとAnyとみなされます。

source: If there are any unhandled @! exceptions, or if any exceptions were caught by the inner SIMPLECATCH (which does nothing but runs its push code, which should not produce any exceptions), then the CATCH block returns them to the exception thrower.
ja: もしハンドルされない@!例外があるなら、または何か一つの例外が内側のSIMPLECATCHにキャッチされるなら（それは何もしないがプッシュコードを実行する。そしてそれはどんな例外も引き起こすべきではない）、CATCHブロックは例外を投げるものにそれを返す。

source: If there are no overlapping captures (as occurs from look-around assertions), the concatenation of all the pair values that chunks returns is the same as the matched part of the string.
ja: 重なり合うキャプチャー（look-aroundアサーションから生じる）がないならば、chunksが返すすべてのペアの値の連結は文字列のマッチされた部分と同じです。

source: If there are no statements in the block at all, the result is also ().
ja: ブロックに文が全くないなら、その結果も()になる。

source: If there is no argument in the parentheses, the type object returns itself:
ja: 括弧に引数がなければ、型オブジェクトは自身を返します。

source: If there is no good way to convert an object to a number, Perl will use the default of 0.
ja: オブジェクトを数に変えるいい方法がないなら、Perlはデフォルトの0を使うでしょう。

source: If there is no such lexically scoped outer loop in the current subroutine, then a fallback search is made outward through the dynamic scopes in the same way Perl 5 does.
ja: もし現在のサブルーチンにそのようなレキシカルスコープの外側のループがないなら、フォールバックの検索はダイナミックスコープを通して外側にPerl 5と同じ方法で行われる。

source: If there's no enclosing block, it's visible throughout the remainder of the file.
ja: 囲んでいるブロックがないならば、それはファイルの残り全体を通して見えます。

source: If there's no further work to do, the routine can decide to hand control completely to the next candidate by calling nextsame or nextwith.
ja: 更にする作業がなければ、ルーチンはnextsameまたはnextwithを呼ぶことによって次の候補へのハンドコントロールを完全に決めることができます。

source: If this constraint returns a false value, the type check will fail when something calls this subroutine (footnote: note that the nominal type is now Real instead of Numeric, because not all Numeric values can be compared for positiveness).
ja: もし制約が偽を返すなら、何かがサブルーチンを呼ぶときに型チェックが失敗します（注釈：名目型はNumericの代わりにRealです。なぜなら全てのNumeric値が正の数と比較できるわけではないからです）。

source: If this were all that roles provided, they'd have few advantages over inheritance or mixins.
ja: これがロールが提供する全てなら、継承やミックスインに勝るほとんど利点がないでしょう。

source: If you don't deal with the failures as data, then sink context will automatically throw any unhandled Failure that you try to discard.
ja: もしデータとして失敗に対処しないなら、 あなたが破棄しようと試みるハンドルされないどれか一つのFailureをsinkコンテキストは自動的にスローする。

source: If you attempt to pass a literal value, a constant, or some other type of immutable object (footnote: An immutable object is an object whose state cannot be changed after it has been created.
ja: もしあなたがリテラル値、定数、または他の型の不変オブジェクト（脚注：不変オブジェクトは、作成された後に状態を変更できないオブジェクトです。

source: If you declare a lexical twice in the same scope, it is the same lexical:
ja: もしもあなたがレキシカルを同じスコープで二回定義したら、それは同じレキシカルだ：

source: If you define a CATCH block within the try, it replaces the default CATCH.
ja: もしCATCHブロックをtry内に定義すると、デフォルトのCATCHを差し替える。

source: If you do not make explicit the methods on which your role depends, the role composer will not verify their existence at compilation time.
ja: あなたがロールが依存するメソッドを明確にしないならば、ロールコンポーザーはコンパイル時にそれらの存在を検証しないでしょう。

source: If you do not wish to accidentally return a list from the final loop statement in a subroutine, place an explicit return statement after it, or use a sink statement prefix on the loop itself.
ja: もしサブルーチンの最後のループ文から偶然にリストを返すことを望まないなら、明白なリターン分をその後に配置するか、sink文接頭辞をループ自身に使え。

source: If you exclude the return statement, then the value produced by the last statement run inside the subroutine will be returned.
ja: もしreturn文を取り除くと、サブルーチン内で最後に実行されたステートメントによって生成された値が返されるでしょう。

source: If you have a switch that is the main block of a for loop that uses $_ as its loop variable, and you break out of the switch either implicitly or explicitly (that is, the switch "succeeds"), control merely goes to the end of that block, and thence on to the next iteration of the loop.
ja: もし$_をループ変数として使っているforループのメインブロックとなっているswitchを持っており、switchを暗黙か明示的に抜けるなら（すなわち、switchが「成功する」）、制御は単にブロックの終わりに行き、そこから次のループの反復に行く。

source: If you pass a Rock as the first argument, T acts as an alias for Rock inside the rest of the signature and the body of the routine.
ja: あなたが最初の引数としてRockを渡すならば、Tは残りのシグネチャーの中のRockとルーチンの本体の別名の働きをします。

source: If you pass it to the multi a, the second candidate, which is specific to Int wins, because nominal types are checked first.
ja: あなたがマルチaにそれを渡すならば名目型が最初にチェックされるので、第二候補Intが勝利します。

source: If you quantify a capture, the corresponding entry in the match object is a list of other match objects:
ja: あなたがキャプチャーを数量化するならば、マッチオブジェクトの対応するエントリは他のマッチオブジェクトのリストです：

source: If you rely on $_ as the implicit parameter to a block, then $_ is considered read/write by default.
ja: もし$_をブロックの暗黙のパラメータとして当てにするなら、$_はデフォルトでread/writeと見なされる。

source: If you run that code, you'll discover that the Int candidate gets called.
ja: そのコードを実行するならば、あなたはInt候補が呼ばれるということを発見するでしょう。

source: If you take multiple items in a comma list (since it is, after all, a list operator), they will be wrapped up in a Parcel object for return as the next argument.
ja: もしコンマリストで複数のアイテムをとるなら（だから、結局、リスト演算子）、それらは次の引数として返すためにParcelオブジェクトにラップされるだろう。

source: If you test a Failure for .defined or .Bool, the Failure marks itself as handled; the exception acts as a relatively harmless undefined value thereafter.
ja: もしFailureを.definedまたは.Boolのためにテストするなら、 Failureはそれ自身をhandledとしてマークする；例外はその後は相対的に無害な未定義値としてふるまう。

source: If you use a for loop with a parameter named $_ (either explicitly or implicitly), that parameter can function as the topic of any when statements within the loop.
ja: もしforループを名前付きパラメータ$_（明示的か暗黙的）と共に使うなら、そのパラメータはループ内のどんなwhen文のトピックとしても機能できる。

source: If you use a variable to create a pair, you can reuse the variable name as the key of the pair.
ja: もしペアを作るために変数を使うなら、変数名をペアのキーに流用できます。

source: If you use the :sigspace modifier, every continuous piece of whitespace calls the built-in rule <.ws>.
ja: あなたが:sigspace修飾子を使用するならば、空白文字のすべての連続的部分は組み込みルール<.ws>を呼びます。

source: If you used order-burger repeatedly, but often with a side of french fries, you might wish that the author had also provided a order-burger-and-fries sub.
ja: もしあなたがorder-burgerを繰り返し使い、しかししばしばサイドでフライドポテトを使うなら、作成者がorder-burger-and-friesも提供することを願うかもしれません。

source: If you want it to be available, you must rewrite it as an explicit block using curlies:
ja: もし使用できるようにしたいなら、カーリーブラケットを使って明白なブロックとして書き直す必要がある：

source: If you want to continue the expression after the statement, or if you want to attach multiple statements, you must either use the curly form or surround the entire expression in brackets of some sort:
ja: もし文の後に式を続けたい、または複数の文を付け加えたいなら、カーリー形式か全体の式をブラケットで囲むかしなければならない：

source: If you want to force a different parsing precedence, surround an expression with parentheses, so that this new group has the tightest possible precedence:
ja: あなたが異なるパースの優先順位を強制したいならば、括弧で式を囲んでください、そうすると、この新しいグループは最も厳しい優先順位を持ちます：

source: If you want to search for a comma, an asterisk, or another non-word character, you must quote or escape it (footnote: To search for a literal string--without using the pattern matching features of regex--consider using index or rindex instead.):
ja: もしコンマ、アスタリスク、他の非ワード文字を検索したいなら、それを必ずエスケープしなければなりません（脚注：リテラル文字列 ― 正規表現のパターンマッチ機能を使わないもの ― を検索するなら、代わりにindexかrindexの使用を検討してください）：

source: If you wish to apply multiple roles at a time, list them all with does.
ja: あなたが一度に複数のロールを適用したいと思うなら、doesでそれらのすべてをリストしてください。

source: If you wish to return a closure from a function, you must use an explicit prefix such as return or sub or ->.
ja: もし関数からクロージャを返したければ、returnまたはsubまたは->のような明白な接頭辞を使わなければならない。

source: If you write a literal that consists only of digits, such as 12, it is an Int.
ja: あなたが数字（例えば12）だけから成るリテラルを書くならば、それはIntです。

source: If you're passing a boolean value, you may omit the value portion of the pair:
ja: もしあなたがブール値を渡すなら、ペアの値の部分を省略できます：

source: If you've referred to $x prior to the first declaration, and the compiler tentatively bound it to $OUTER::x, then it's an error to declare it, and the compiler is required to complain at that point.
ja: もしあなたが最初の宣言の前に$xを参照し、コンパイラがそれを仮に$OUTER::xにバインドしたら、それを宣言することはエラーであり、コンパイラがその時点で文句を言う必要がある。

source: If your operating system (footnote: Ubuntu 10.4: In System/Preferences/Keyboard/Layouts/Options/Compose Key position select one of the keys to be the "Compose" key.
ja: もしあなたのオペレーティングシステム(footnote: Ubuntu 10.4: In System/Preferences/Keyboard/Layouts/Options/Compose Key position select one of the keys to be the "Compose" key.

source: If your personal order is always vegetarian, you might instead wish for a order-the-usual sub.
ja: あなた個人のオーダーが常にベジタリアンなら、代わりにorder-the-usualを望むかもしれません。

source: If, instead of throwing a warning directly, the program calls fail() with a resumable exception, the throwing of the warning is delayed until first use (or the caller's policy) requires it to be thrown.
ja: もし代わりに例外を直接スルーするなら、プログラムはfail()を再開可能な例外と共に呼ぶ。警告のスローは最初の使用（または呼び出し元のポリシー）がスローを要求するまで延ばされる。

source: If, instead, you want a local copy of the argument to work with inside the subroutine - leaving the caller's variable untouched - use the is copy trait:
ja: 代わりに、サブルーチン内で作業するためのローカルコピーが欲しいなら ― 呼び出し元の変数を触らない ― is copyトレイトを使ってください：

source: Ignore the new method temporarily; it's a special type of method.
ja: newメソッドは一旦無視してください；それは特別なタイプのメソッドです。

source: Implicit whitespace is matched with the inherited regex <ws>, so the simplest approach to enable single- line comments is to override that named regex:
ja: 暗黙の空白は継承された正規表現<ws>でマッチされるので、シングルラインコメントを利用可能にする最も単純なアプローチは、その名前付き正規表現をオーバーライドすることです。

source: In JSON::Tiny::Grammar, A is '{', B is '}' and C is <pairlist>.
ja: JSON::Tiny::Grammar内で、Aは'{'、Bは'}'、そしてCは<pairlist>です。

source: In Perl 5, a bare block is deemed to be a do-once loop.
ja: Perl 5では、裸のブロックはdo-onceループと判断される。

source: In Perl 6, although the specific syntax used to describe the patterns is different from PCRE (footnote: Perl Compatible Regular Expressions) and POSIX (footnote: Portable Operating System Interface for Unix.
ja: Perl 6では、パターンを記述するのに用いられる特定の構文は、PCREやPOSIXと異なります。

source: In Perl 6, control flow is designed to do what the user expects most of the time, but this implies that we must consider the declarative nature of labels and blocks and combine those with the dynamic nature of the call stack.
ja: Perl 6では制御フローはユーザーが殆どの場合期待する通りにデザインされているが、これは宣言的な性質のラベルとブロックとコールスタックの動的な性質とそれらを結びつけることについて我々が考えなければならないことを伴う。

source: In Perl 6, curry with the .assuming method:
ja: Perl 6では.assumingメソッドでカリー化してください：

source: In Perl 6, the bare block is not a do-once.
ja: Perl 6では裸のブロックはdo-onceではない。

source: In Perl 6, the variables in a subroutine's signature are read-only references to the passed arguments by default.
ja: Perl 6のデフォルトでは、サブルーチンシグネチャーの変数は渡された引数の読み取り専用の参照です。

source: In a boolean context, a Hash object is true if there are any pairs in the hash.
ja: ブールコンテキストでは、ハッシュに何らかのペアがあればハッシュオブジェクトは真です。

source: In a sense, the operators described in chapter 3 are also subroutines that Perl 6 parses in interesting ways.
ja: ある意味では、第3章で記述される演算子は、Perl 6が興味深い方法で解析するサブルーチンでもあります。

source: In a signature, a variable's sigil also acts as a constraint on the type of argument that can be passed.
ja: シグネチャーでは、変数のシギルは引数に渡すことができる型の制約としても機能します。

source: In addition to next, last, and redo, Perl 6 also supports goto.
ja: next、last、redoに加えてPerl 6はgotoもサポートする。

source: In addition to collecting all of the values, a slurpy parameter will also flatten any arrays that it collects, so that you end up with a single, flat list.
ja: すべての値を集めるのに加えて、slurpyパラメータは値を集める配列をフラットにします。そのため、単一のフラットなリストになります。

source: In any case, all formal parameters are the equivalent of my variables within the block.
ja: いずれにせよ、全ての仮パラメータはブロック内のmy変数と同等だ。

source: In any case, the overriding design principle here is that no unhandled exception is ever dropped on the floor, but propagated outward until it is handled.
ja: いずれにせよ、ここでのオーバーライドのデザイン原理は、ハンドルされない例外は常に床に落ちる。しかしハンドルされるまで外側に伝搬される。

source: In boolean context, a match object returns True for successful matches and False for failed ones.
ja: ブール値コンテキストでは、マッチオブジェクトは成功マッチならTrue、そして失敗ならFalseを返します。

source: In boolean contexts, a true value is returned if and only if there are any elements in the container.
ja: ブール値コンテキストでは何らかの要素がコンテナにあれば真を返します。

source: In either case this sets the of property of the container to Dog.
ja: いずれもコンテナのofプロパティにDogをセットします。

source: In fact, a grammar is a class which by default inherits from Grammar instead of Any.
ja: 実際、グラマーはデフォルトでAnyの代わりにGrammarを継承するクラスです。

source: In fact, most of these phasers will take either a block or a thunk (known as a blast in the vernacular).
ja: 実際は、大部分のphasersはブロックかサンク（固有の言葉でblastとして知られる）をとる。

source: In fact, quite the opposite.
ja: 実際は正反対です。

source: In fact, this construct would be relatively useless if you could bind only boolean values as parameters, since within the closure you already know whether it evaluated to true or false.) Binding within an else automatically binds the value tested by the previous if or elsif, which, while known to be false, might nevertheless be an interesting value of false.
ja: 実際は、もしあなたがブール値をパラメータとしてしかバインドしないなら、この構成物は相対的に役に立たない。だから、あなたはクロージャの範囲内でそれが真か偽で評価されるかすでに知っている。elseのバインドは値を前にテストしたifかelsifに自動的にバインドし、偽と判明している間、面白い偽の値にも関わらず。

source: In general, for most iterated solutions you should consider using a for loop instead (see below).
ja: 一般に、最も繰り返される解決法のためにあなたはforループを代わりに使うことを検討すべきだ（下記参照）。

source: In general, initializing phasers execute in order declared, while finalizing phasers execute in the opposite order.
ja: 一般にphasersの初期化は宣言順に実行し、ファイナライズは逆順に実行する。

source: In item context, variables such as @array and %hash simply return themselves as Array and Hash objects.
ja: アイテムコンテキストでは@arrayと%hashのような変数は単にそれら自身をArrayとHashのオブジェクトとして返します。

source: In its simplest form, a signature is a comma separated list of variable names to which to bind incoming arguments.
ja: 最も単純な形では、シグネチャーは入ってくる引数をバインドする変数名をコンマで区切ったリストです。

source: In many ways, this looks a lot like a sub declaration.
ja: 様々な点でこれはsub宣言に似ています。

source: In most interesting programs the dynamic scopes are nested quite differently from the lexical scopes, so it's important to distinguish carefully which kind of scoping we're talking about.
ja: 最も興味深いプログラムでは、ダイナミックスコープはレキシカルスコープと全く違うように入れ子になっている。そういうわけで、我々が話しているようなスコープとは注意深く区別することが大切だ。

source: In normal English text, you always place a whitespace after a comma.
ja: 通常の英語テキストでは、あなたは常にコンマの後に空白文字を置きます。

source: In numeric context (i.e. when cast into Int or Num), a Hash object becomes the number of pairs contained in the hash.
ja: 数値コンテキスト（すなわちIntまたはNumにキャストする時）では、Hashオブジェクトはハッシュに含まれるペアの数になります。

source: In numeric contexts, the number of elements in the container is returned.
ja: 数値コンテキストではコンテナの要素数が返されます。

source: In order to do this, add an array parameter to the signature, placing the slurpy prefix (*) before it.
ja: こうするために、シグネチャの配列パラメータの前にslurpy接頭辞（ *）を置いてください。

source: In other object systems, classes perform two tasks.
ja: 他のオブジェクトシステムでは、クラスは2つの仕事を果たします。

source: In other programming languages, such as C/C++ and Scheme, this evaluation strategy is known as pass-by-value.
ja: C/C++やSchemeのような他のプログラミング言語では、この評価方法は値渡しとして知られています。

source: In other words, it first tries this form:
ja: 言い換えれば、最初にこの形式を試す：

source: In particular,
ja: 特に、

source: In particular, this means that once can make use of any parameters passed in on the first call, whereas INIT cannot.
ja: 特に、onceは最初の呼び出しで任意のパラメータを使えるようにするのに対し、INITはできない。

source: In particular, we now generally use for to iterate filehandles.
ja: 特に、我々は現在一般的にforをファイルハンドルを反復するために使う。

source: In place of $n it prints the contents of the variable $n-- the names of players stored in $n.
ja: $nの代わりに変数$nの内容 ― $nに保存されたプレイヤーの名前を出力します。

source: In practice, using :_ is a bit redundant.
ja: 実際には:_の使用は少し冗長です。

source: In prose, the comment starts with '//' and extends to the rest of the line.
ja: 要するにコメントは'//'から始まり、行の残りまで続きます。

source: In string contexts, lists and list-like objects automatically stringify to appropriate (white-space separated) string values.
ja: 文字列コンテキストでは、リストとリストのようなオブジェクトは自動的に適切な（空白で区切られた）文字列値に文字列化されます。

source: In that case, use the but operator, which clones the object, performs the role composition with the clone, and returns the clone.
ja: その場合には、but演算子（それはオブジェクトのクローンをつくります）がクローンでロール合成を実行します。そしてそのクローンを返します。

source: In that case, you may also call the callable parameter without the & sigil:
ja: その場合、呼び出し可能なパラメータを&シギル無しで呼ぶことができます：

source: In the absence of explicit control flow terminating the block early, the return value of a block is the value of its final statement.
ja: ブロックを早期に終える明白な制御フローがない場合、ブロックの返り値は最後の文の値だ。

source: In the case of multi dispatch, the narrowest match always wins.
ja: マルチディスパッチの場合、最も制限されたマッチは常に勝ちます。

source: In the case of the JSON parser, the payload is the data structure that the JSON string represents.
ja: JSONパーサーの場合、ペイロードはJSON文字列が表すデータ構造です。

source: In the case of:
ja: この場合：

source: In the case where you want all your parameters to default to rw, you may use the visually suggestive double-ended arrow to indicate that values flow both ways:
ja: このケースで全てのパラメータをrwとしたいなら、値の流れを視覚的に表す両頭矢印を使ってもよい：

source: In the context of a role, this means that any class which composes this role must somehow provide a method named bot-nick.
ja: ロールのコンテキストでは、このロールを合成するクラスは何でもbot-nickという名前のメソッドをどうにかして提供しなければならないということを意味します。

source: In the context of multiple dispatch, nested signatures take on a second task: they act as constraints to distinguish between the candidates.
ja: 複数のディスパッチの文脈では、入れ子になったシグネチャーは第二タスクを引き受けます：それらは、候補を区別する制約の働きをします。

source: In the course of matching a regex against a string, the regex engine may reach a point where an alternation has matched a particular branch or a quantifier has greedily matched all it can, but the final portion of the regex fails to match.
ja: 文字列に対して正規表現をマッチする間、正規表現エンジンは論理和が特定の分岐にマッチした、または数量詞がすべてそれに可能な貪欲に合うものを見つけたポイントに到達します。しかし正規表現の最終的な部分はマッチに失敗します。
